{
  "apply_discount_code": "Apply a promotional or discount code to the order or cart.",
  "remove_discount_code": "Remove or deactivate a previously applied discount/promo code from the order.",
  "check_cart_items": "Verify the list of items currently in the shopping cart and their quantities.",
  "check_wishlist": "Retrieve or view items saved in the user’s wishlist.",
  "add_to_wishlist": "Add a product to the user’s wishlist or favourites list.",
  "remove_from_wishlist": "Remove a product from the user’s wishlist or favourites list.",
  "share_wishlist": "Share the wishlist with another user or via link/email.",
  "gift_wrap_option": "Request or inquire about the gift-wrapping option for an order.",
  "schedule_delivery": "Schedule or change the delivery date/time for an order.",
  "change_delivery_address": "Update the delivery/shipping address for an existing order.",
  "split_order_items": "Split order items into multiple shipments or delivery dates.",
  "combine_orders": "Combine multiple orders or shipments into one delivery.",
  "checkout_guest": "Proceed to checkout as a guest (without account login).",
  "checkout_saved_address": "Use a previously saved address for checkout or change default address.",
  "select_payment_plan": "Choose a payment instalment or payment-plan option (e.g., 0% interest instalments).",
  "apply_store_credit": "Use existing store credit, gift card, or account credit toward purchase.",
  "inquire_gift_card_balance": "Check the available balance on a gift card or account credit.",
  "redeem_gift_card": "Redeem a gift card or voucher toward purchase.",
  "report_missing_coupon": "Report or query a missing coupon discount that should have been applied.",
  "product_recommendation_request": "Ask for personalized product recommendations based on preferences or history.",
  "compare_products": "Request side-by-side comparison of two or more products (features, price, reviews).",
  "check_product_reviews": "View customer reviews or ratings of a specific product.",
  "submit_product_review": "Submit a review or rating for a purchased product.",
  "request_size_chart": "Ask for the size/fit chart information for apparel or footwear items.",
  "check_product_material_info": "Inquire about product material/composition (e.g., fabric, metal type).",
  "check_backorder_status": "Ask if a currently out-of-stock item is on backorder and when it may ship.",
  "notify_when_available": "Sign up for a notification when a product becomes available/in stock again.",
  "request_bulk_pricing": "Inquire about bulk-purchase pricing or wholesale discount for multiple items.",
  "request_product_bundle": "Ask about available product bundles or multipacks promotions.",
  "gift_message_request": "Add or edit a gift message for an order to be sent to recipient.",
  "track_return_status": "Track the status of a returned product or refund process.",
  "cancel_return_request": "Cancel a previously initiated return request before processing.",
  "exchange_out_of_store": "Request exchange of a product via an alternate channel (e.g., via mail when store exchange not possible).",
  "request_restock_date": "Ask when a specific product will be restocked or released again.",
  "preorder_product": "Pre-order an upcoming product not yet released or shipped.",
  "cancel_preorder": "Cancel a previously placed pre-order before release/shipment.",
  "price_drop_alert_setup": "Set up an alert for when the price of a product drops below a certain threshold.",
  "price_match_request": "Request a price match guarantee or price adjustment after purchase if price drops.",
  "loyalty_points_balance_query": "Check the balance of loyalty/reward points in the user’s account.",
  "redeem_loyalty_points": "Redeem loyalty/reward points for products, discounts or offers.",
  "tier_membership_upgrade": "Ask about upgrading membership tier in a loyalty program (e.g., gold to platinum).",
  "subscription_cancel": "Cancel a subscription service tied to product deliveries (e.g., monthly box).",
  "subscription_pause": "Pause a recurring subscription delivery/service.",
  "subscription_resume": "Resume a previously paused subscription service.",
  "subscribe_to_newsletter": "Subscribe the user email to the store’s promotional newsletter.",
  "unsubscribe_from_newsletter": "Unsubscribe the user email from the store’s promotional newsletter.",
  "opt_in_sms_alerts": "Opt-in to SMS/promotional alerts from the e-commerce platform.",
  "opt_out_sms_alerts": "Opt-out of SMS/promotional alerts from the e-commerce platform.",
  "request_order_invoice_pdf": "Request the PDF invoice of a completed order.",
  "request_custom_engraving": "Ask for custom engraving, monogramming, or personalization of a product.",
  "check_warranty_coverage": "Check warranty coverage or extended warranty status for a product."
}